{
  "About": "About Winerva",
  "Support": "Support",
  "Other": "Other",
  "Theme": "Theme",
  "An": "A",
  "Booster": "Precision Visual Inspection",
  "to_Your_NextJS_Apps": "12+ years optimizing production efficiency.",
  "An_approachable_performant_and_versatile_boilerplate_for_building_SSR_applications": "Our best strategic partnership.",
  "Use_Template": "Use Template",
  "Learn_More": "Learn More!",
  "Approachable": "Expertise in Image Processing and Computer Vision",
  "Add_components_without_sending_additional_client_side_JavaScript_Built_on_the_latest_React_features": "Add components without sending additional client-side JavaScript. Built on the latest React features.Proficient in image processing, computer vision, and machine learning, with expertise in OpenCV, TensorFlow, structured light, SfM, and STN. Experienced in optical calibration, image alignment, and object recognition, effectively enhancing the accuracy and performance of vision systems.",
  "Automatic_Image_Font_and_Script_Optimizations_for_improved_UX_and_Core_Web_Vitals": "Skilled in multiple technology stacks, including Python, C#, Node.js, Next.js, and React, with deep knowledge of Modbus, WebRTC, and OCPP protocols. Experienced in PyQt/PySide6 for UI development, seamlessly integrating machine vision, industrial automation, and web applications to deliver comprehensive solutions.",
  "Versatile": "Cross-Disciplinary System Integration and Efficient Development",
  "A_rich_incredibly_adoptable_template_that_scales_between_a_small_showcase_website_and_a_full_size_app": "Developed AI-driven optimization for a five-axis motion control platform, utilizing reinforcement learning and predictive AI models to fine-tune mirror reflections and improve beam alignment. Capable of designing intelligent control algorithms based on sensor data and image feedback to enhance system stability and precision.",
  "This_is_a_simple_about_page_just_to_show_how_you_can_use_the_internationalization_in_different_pages": "This is a simple about page just to show how you can use the internationalization in different pages",
  "Performant": "Intelligent Control and AI Optimization",
  "Practical_examples": "Practical examples",
  "Company": "Winerva Software Technology Co., Ltd.",
  "Company_Label": "Company Name",
  "Company_Phone": "Phone",
  "Email": "Email",
  "Contact_Info": "Contact Information",
  "Contact_Us": "Contact Us",
  "Message": "Message",
  "Name": "Name",
  "Blog": "Blog",
  "ViewPDF": "View PDF",
  "Strengths_and_Abilities": "Strengths and Abilities",
  "Main_Products_Services": "Main Products / Services",
  "Core_Technology_of_AOI_Equipment": "Core Technology of AOI Equipment:",
  "The_planninng_of":"The planning of relevant software and hardware required for the visual image automatic identification system. This AOI core technology is applied in small and medium enterprises, as well as in the semiconductor, TFT, and inspection fields. It is projected to be one of the fastest-growing, most important, and most talent-scarce automation core technologies in the next twenty to thirty years globally.",
  "Full_Stack_Development_Services": "Full-Stack Development Services:",
  "Our_full_stack_development":"Our full-stack development services focus on creating powerful and user-friendly websites and applications. We integrate the latest technologies in the industry to seamlessly connect frontend and backend needs, ensuring your application delivers not only an outstanding user experience but also operates efficiently on the backend.",
  "Professional_Services_and_Background": "Professional Services and Background",
  "Computer_Vision_Technology": "Computer Vision Technology :",
  "Over_12_years": "Over 12 years of experience in image processing, object detection, and 3D reconstruction.",
  "Machine_Learning_and_Deep_Learning": "Machine Learning and Deep Learning :",
  "Implementing_real_time_object_detection": "Implementing real-time object detection systems and developing high-performance defect detection solutions.",
  "Full_Stack_Development": "Full-Stack Development :",
  "Expertise_in_Nextjs": "Expertise in Next.js, React, and TypeScript, developing scalable web applications.",
  "Industrial_Automation_and_Visual_Inspection": "Industrial Automation and Visual Ins :",
  "Designing_and_implementing_high": "Designing and implementing high-precision automation systems to improve inspection efficiency.",
  "Visual_System_Integration": "Visual System Integration :",
  "Providing_lighting_technology": "Providing lighting technology, camera and lens selection to ensure optimal image quality.",
  "Automation_Integration_and_Robotic_Arm_Applications": "Automation Integration and Robotic :",
  "Achieving_seamless_inntegration": "Achieving seamless integration of robotic arms and visual systems, providing complete backend support.",
  "Real_Time_Visual_Image_Development": "Real-Time Visual Image Development :",
  "Offerinng_visual_image_development": "Offering visual image development and evaluation, developing intuitive UIs and integrating backend data processing systems.",
  "LINE_SCAN_and_MOTION_Integration_Technology": "LINE SCAN and MOTION Integration Tech :",
  "Achieving_real_time_processinng": "Achieving real-time processing of visual images, motion control, and data visualization.",
  "Company_Operating_Philosophy": "Company Operating Philosophy",
  "Leading_Technology": "Leading Technology :",
  "We_connstantly_drive": "We constantly drive technological innovation and stay ahead of the industry.",
  "Honest_Service": "Honest Service :",
  "We_base_our_service": "We base our service on integrity, providing transparent and sincere services.",
  "Mutual_Support_and_Care": "Mutual Support and Care :",
  "We_consider_mutual": "We consider mutual support as our core value for joint growth.",
  "Unity_and_Innovation": "Unity and Innovation :",
  "We_uphold_the_power": "We uphold the power of unity and continuously innovate.",
  "Co_Creating_Value": "Co-Creating Value :",
  "We_work_together_with_our": "We work together with our clients to create long-term value.",
  "If_you_have_any_questions": "If you have any questions or need further understanding of our technologies and services, please feel free to contact us.",
  "Our_confidence_comes_from_our_strength_and_our_experience_comes_from_our_clients_trust": "Our confidence comes from our strength, and our experience comes from our clients' trust.",
  "Our_company_was_established_in_2015": "Our company was established in 2015 and places a high value on credibility and professional image. All members of the company have an average of over 6 years of professional experience in visual-related product sales and technology. Therefore, we have a deep understanding of the Taiwanese market and our clients' needs. We possess extensive experience in visual inspection and automation control, and are capable of assisting clients with project development.",
  "201408Project": "Screw sorting machine visual inspection program",
  "201408ProjectDetail": "Using four cameras to detect internal thread defects in nuts",
  "201908Project": "Automation Taipei 2019",
  "201908ProjectDetail": "Using Hiwin Robotic Arm and Halcon Image Processing to Implement Random Pick and Place",
  "201910Project": "Internal surface defect detection of canned beverages",
  "201910ProjectDetail": "Integrate IDS industrial cameras with LabView system, develop visual inspection function library with Halcon, and provide it to LabView system for calling",
  "202008Project": "Automation Taipei 2020",
  "202008ProjectDetail": "Demonstrating digital images through process integration of hyperspectral cameras, 3D cameras, Flir thermal imaging cameras, 2D color cameras and capture cameras",
  "202009Project": "Greenhouse Instrumentation and Control Project of Academia Sinica Agricultural and Biological Research Center",
  "202009ProjectDetail": "Greenhouse instrumentation project: Integrate hyperspectral cameras, 3D cameras, Flir thermal imaging cameras, and 2D color cameras, store the captured data in the database, and use PLC to control the gantry to collect plant data at fixed times and points, and analyze the hyperspectral data of plants through PlantCV",
  "202011Project": "Optical Positioning Analysis Project",
  "202011ProjectDetail": "Optically locate the position of the capacitor cover and send the determined position to the machine via Modbus for the machine to pick and place materials.",
  "202107Project": "Molicel Technology Round Battery Visual Inspection Project",
  "202107ProjectDetail": "Use 3 Sentech industrial cameras to check whether the blue cover of the battery cover is intact and whether the upper edge of the battery is damaged.",
  "202409Project": "Handmade Paper Factory Paper Measurement Project",
  "202409ProjectDetail":"Four waterproof and dustproof IDS high-resolution color cameras are installed at the entrance and exit of the paper heating process machine to measure the paper.",
  "No_PDF_Manual_Yet": "No PDF manual yet",
  "Portfolio_001_Title": "Capacitance height measurement", 
  "Portfolio_001_Description": "This detection system is installed in the capacitor process machine to judge the results of the manufacturing process and feedback the height information to adjust the process parameters.",
  "Portfolio_002_Title": "Coating process: Nozzle leakage detection", 
  "Portfolio_002_Description": "For nozzle leakage during the coating process, records are kept and the alarm system is notified via Modbus. This system runs in the Docker Container environment of the Linux platform",
  "Portfolio_003_Title": "Battery insulation sheet assembly abnormality detection", 
  "Portfolio_003_Description": "Check whether the blue insulating sheet on the round battery cover is assembled abnormally and whether the battery can mouth is damaged",
  "Portfolio_004_Title": "Label bump analysis", 
  "Portfolio_004_Description": "The optical technology used is Photometric stereo, which obtains image height information from images taken under different light sources.",
  "Portfolio_005_Title": "Car light source detection", 
  "Portfolio_005_Description": "Through the IO card and the light source controller, the car lights have four different light source switching to detect the light source brightness area",
  "Portfolio_006_Title": "OCR visual recognition", 
  "Portfolio_006_Description": "Many instruments in factories have digital meters. By analyzing the images on the monitor, the area of ​​the digital meter is captured for OCR recognition.",
  "Portfolio_007_Title": "Hyperspectral Data Analysis of Plants", 
  "Portfolio_007_Description": "Read images, HDR, and RAW files, convert RAW files into Spectral Data format according to ENVI header, and then use PlantCV Framework to calculate the normalized vegetation index, soil-adjusted vegetation index, and green difference direct cover index",
  "Portfolio_008_Title": "FLIR Data Analysis for Plants", 
  "Portfolio_008_Description": "Use FlirRaw.exe to convert Flir RAW files into CSV and Histogram files. You can filter the plant area within the threshold by temperature.",
  "Portfolio_009_Title": "Plant point cloud data analysis", 
  "Portfolio_009_Description": "Analyze the point cloud of plants to calculate the volume, height, leaf area, and leaf angle of the plants",
  "Portfolio_010_Title": "Agricultural Products Scale System", 
  "Portfolio_010_Description": "Connect to electronic scale system for agricultural product grading",
  "Portfolio_011_Title": "Agricultural Products Visual Grading System", 
  "Portfolio_011_Description": "Agricultural product grading based on appearance and area through color visual images"
}
